Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParserFactory
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParserFactory.CreateParser
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Creates a filter parser.
Returns: A new filter parser.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParserFactory.CreateParser(Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParserType)
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.
Creates a filter parser of a specific type.
FilterExpressionParserType: The filter parser type to be used.
Returns: A new filter parser.